### Practice 0720

#### Grouping Rows by Time

In [1]:
import pandas as pd
import numpy as np
# Create date range
time_index = pd.date_range('06/06/2017', periods=100000, freq='30S')

In [2]:
df=pd.DataFrame(index=time_index)

In [3]:
df['Sale Amount'] = np.random.randint(1, 10, 100000)

In [4]:
# group rows by week, aggregate by sum (resample)
df.resample('W').sum()

            Sale Amount
2017-06-11        86846
2017-06-18       100662
2017-06-25       100922
2017-07-02       100714
2017-07-09       100202
2017-07-16        10545

In [5]:
df.head(3)

                     Sale Amount
2017-06-06 00:00:00            2
2017-06-06 00:00:30            5
2017-06-06 00:01:00            3

In [8]:
df.resample('2W').mean()

            Sale Amount
2017-06-11     5.025810
2017-06-25     4.999603
2017-07-09     4.983036
2017-07-23     5.069712

In [9]:
df.resample('M').count()

            Sale Amount
2017-06-30        72000
2017-07-31        28000

In [10]:
# default resample returns the 'right' edge of the range, can change
# this with the 'label' parameter:
df.resample('M', label='left').count()

            Sale Amount
2017-05-31        72000
2017-06-30        28000